In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

# Pierwsza ramka danych

In [5]:
ramka1 = pd.DataFrame({"A" : np.round(np.random.uniform(0, 1, 5), 2),
                      "B": ["k", None, "k", "m", "k"],
                      "C": [False, True, True, False, False]})

In [6]:
ramka1

      A     B      C
0  0.81     k  False
1  0.33  None   True
2  0.19     k   True
3  0.77     m  False
4  0.28     k  False

# Wymiary ramki

In [7]:
ramka1.shape

(5, 3)

In [8]:
len(ramka1)

5

In [10]:
ramka1.size

15

# Wycztanie gotowej ramki danych

In [11]:
flights = sns.load_dataset("flights")

In [12]:
flights

     year      month  passengers
0    1949    January         112
1    1949   February         118
2    1949      March         132
3    1949      April         129
4    1949        May         121
..    ...        ...         ...
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

[144 rows x 3 columns]

In [13]:
tips = sns.load_dataset("tips")

In [14]:
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

# Metody zapoznania siÄ™ z ramkÄ… danych

In [15]:
flights.head()

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [16]:
flights.head(3)

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132

In [17]:
flights.head(8)

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121
5  1949      June         135
6  1949      July         148
7  1949    August         148

In [18]:
flights.tail()

     year      month  passengers
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

In [19]:
flights.tail(3)

     year     month  passengers
141  1960   October         461
142  1960  November         390
143  1960  December         432

In [20]:
flights.tail(8)

     year      month  passengers
136  1960        May         472
137  1960       June         535
138  1960       July         622
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

In [25]:
type(flights)

pandas.core.frame.DataFrame

In [22]:
flights.dtypes

year             int64
month         category
passengers       int64
dtype: object

In [26]:
type(flights.dtypes)

pandas.core.series.Series

In [27]:
flights.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 144 entries, 0 to 143
Data columns (total 3 columns):
year          144 non-null int64
month         144 non-null category
passengers    144 non-null int64
dtypes: category(1), int64(2)
memory usage: 2.9 KB

In [28]:
ramka1

      A     B      C
0  0.81     k  False
1  0.33  None   True
2  0.19     k   True
3  0.77     m  False
4  0.28     k  False

In [29]:
ramka1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
A    5 non-null float64
B    4 non-null object
C    5 non-null bool
dtypes: bool(1), float64(1), object(1)
memory usage: 213.0+ bytes

# Wybieranie kolumn

In [31]:
flights.dtypes

year             int64
month         category
passengers       int64
dtype: object

In [30]:
ramka1["A"]

0    0.81
1    0.33
2    0.19
3    0.77
4    0.28
Name: A, dtype: float64

In [32]:
type(ramka1["A"])

pandas.core.series.Series

In [34]:
# ten sposÃ³b moÅ¼e nas zawieÅ›Ä‡ w dwÃ³ch przypadkach:
# 1) spacja w nazwie kolumny
# 2) nazwa kolumny pokrywa siÄ™ z atrybutem, np. columns
ramka1.A

0    0.81
1    0.33
2    0.19
3    0.77
4    0.28
Name: A, dtype: float64

In [35]:
ramka1.columns

Index(['A', 'B', 'C'], dtype='object')

In [36]:
ramka1.get("A")

0    0.81
1    0.33
2    0.19
3    0.77
4    0.28
Name: A, dtype: float64

In [37]:
# dostajemy ramke danych, a nie Series
ramka1[["A", "B"]]

      A     B
0  0.81     k
1  0.33  None
2  0.19     k
3  0.77     m
4  0.28     k

In [38]:
# konsekwentnie gdy lista ma jeden element, dalej dostajemy ramke danych
ramka1[["A"]]

      A
0  0.81
1  0.33
2  0.19
3  0.77
4  0.28

In [39]:
# prosty sposÃ³b na zmianÄ™Â kolejnoÅ›ci kolumn
ramka1[["B", "A"]]

      B     A
0     k  0.81
1  None  0.33
2     k  0.19
3     m  0.77
4     k  0.28

# Pod spodem wektory z Numpy

In [40]:
ramka1.A.values

array([0.81, 0.33, 0.19, 0.77, 0.28])

# Typ kategoryczny

In [42]:
flights.head(3)

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132

In [43]:
flights.dtypes

year             int64
month         category
passengers       int64
dtype: object

```
blondynka
brunetka
szatynka
blondynka
brunetka
brunetka
szatynka
zsatyn
```

Jako napis:
* zajmuje duÅ¼o miejsca
* gdy wywoÅ‚am funkcjÄ™ na kolumnie, muszÄ™ wiele razy liczyÄ‡ to samo
* brak kontroli wpisywanych wartoÅ›ci (brak odpornoÅ›ci na literÃ³wki)
* zmiana interpretacji (np. z blondyna na blondynkÄ™) jest czasochÅ‚onna

Kategoria:

mamy sÅ‚ownik:

```
1 -> blondynka
2 -> szatyn
3 -> brunet
```


```
1
1
3
2
3
2
1
```

In [45]:
ramka1

      A     B      C
0  0.81     k  False
1  0.33  None   True
2  0.19     k   True
3  0.77     m  False
4  0.28     k  False

In [44]:
ramka1.dtypes

A    float64
B     object
C       bool
dtype: object

In [46]:
ramka1.B.astype("category")

0      k
1    NaN
2      k
3      m
4      k
Name: B, dtype: category
Categories (2, object): [k, m]

In [47]:
ramka1.dtypes

A    float64
B     object
C       bool
dtype: object

In [48]:
ramka1.B = ramka1.B.astype("category")

In [49]:
ramka1.dtypes

A     float64
B    category
C        bool
dtype: object

In [50]:
ramka1

      A    B      C
0  0.81    k  False
1  0.33  NaN   True
2  0.19    k   True
3  0.77    m  False
4  0.28    k  False

In [51]:
inna_kategoryczna = pd.Series(pd.Categorical(["a", "b", "c", "a"]))
inna_kategoryczna

0    a
1    b
2    c
3    a
dtype: category
Categories (3, object): [a, b, c]

In [52]:
inna_kategoryczna = pd.Series(pd.Categorical(["a", "b", "c", "a"],
                                            categories=["d", "c", "b", "a"]))
inna_kategoryczna

0    a
1    b
2    c
3    a
dtype: category
Categories (4, object): [d, c, b, a]

Zmienna jakoÅ›ciowa porzÄ…dkowa:

`kogucia` < `lekka` < `ciÄ™Å¼ka`

In [53]:
inna_kategoryczna = pd.Series(pd.Categorical(["a", "b", "c", "a"],
                                            categories=["d", "c", "b", "a"],
                                            ordered = True))
inna_kategoryczna

0    a
1    b
2    c
3    a
dtype: category
Categories (4, object): [d < c < b < a]

In [54]:
inna_kategoryczna.cat.codes

0    3
1    2
2    1
3    3
dtype: int8

In [55]:
inna_kategoryczna.cat.categories

Index(['d', 'c', 'b', 'a'], dtype='object')

In [56]:
inna_kategoryczna

0    a
1    b
2    c
3    a
dtype: category
Categories (4, object): [d < c < b < a]

In [58]:
inna_kategoryczna[0] = "d"

In [59]:
inna_kategoryczna

0    d
1    b
2    c
3    a
dtype: category
Categories (4, object): [d < c < b < a]

In [60]:
inna_kategoryczna[0] = "e"

ValueError: Cannot setitem on a Categorical with a new category, set the categories first

In [63]:
inna_kategoryczna = inna_kategoryczna.cat.add_categories("e")
inna_kategoryczna

0    d
1    b
2    c
3    a
dtype: category
Categories (5, object): [d < c < b < a < e]

In [66]:
inna_kategoryczna = inna_kategoryczna.cat.reorder_categories(["c", "a", "d", "e", "b"])
inna_kategoryczna

0    d
1    b
2    c
3    a
dtype: category
Categories (5, object): [c < a < d < e < b]

In [68]:
inna_kategoryczna.cat.categories = ["musza", "lekka", "kogucia", "Å›rednia", "ciÄ™Å¼ka"]
inna_kategoryczna

0    kogucia
1     ciÄ™Å¼ka
2      musza
3      lekka
dtype: category
Categories (5, object): [musza < lekka < kogucia < Å›rednia < ciÄ™Å¼ka]

In [69]:
ramka1

      A    B      C
0  0.81    k  False
1  0.33  NaN   True
2  0.19    k   True
3  0.77    m  False
4  0.28    k  False

In [70]:
pd.cut(ramka1.A, np.r_[0, 0.25, 0.4, 0.7, 1])

0     (0.7, 1.0]
1    (0.25, 0.4]
2    (0.0, 0.25]
3     (0.7, 1.0]
4    (0.25, 0.4]
Name: A, dtype: category
Categories (4, interval[float64]): [(0.0, 0.25] < (0.25, 0.4] < (0.4, 0.7] < (0.7, 1.0]]

In [73]:
wagi_bokserskie = pd.cut(ramka1.A, np.r_[0, 0.25, 0.4, 0.7, 1], 
       labels = ["lekka", "musza", "Å›rednia", "ciÄ™Å¼ka"])
wagi_bokserskie

0    ciÄ™Å¼ka
1     musza
2     lekka
3    ciÄ™Å¼ka
4     musza
Name: A, dtype: category
Categories (4, object): [lekka < musza < Å›rednia < ciÄ™Å¼ka]

In [74]:
wagi_bokserskie.sort_values()

2     lekka
1     musza
4     musza
0    ciÄ™Å¼ka
3    ciÄ™Å¼ka
Name: A, dtype: category
Categories (4, object): [lekka < musza < Å›rednia < ciÄ™Å¼ka]

# Indeksy

In [75]:
ramka1

      A    B      C
0  0.81    k  False
1  0.33  NaN   True
2  0.19    k   True
3  0.77    m  False
4  0.28    k  False

In [76]:
ramka1.index

RangeIndex(start=0, stop=5, step=1)

In [77]:
ramka1.columns

Index(['A', 'B', 'C'], dtype='object')

In [78]:
ramka2 = ramka1.copy()

In [79]:
ramka2.index = ["a", "b", "c", "d", "e"]
ramka2

      A    B      C
a  0.81    k  False
b  0.33  NaN   True
c  0.19    k   True
d  0.77    m  False
e  0.28    k  False

In [80]:
ramka2.index = [0.25, 0.7, 0.3, 0.6, 0.5]
ramka2

         A    B      C
0.25  0.81    k  False
0.70  0.33  NaN   True
0.30  0.19    k   True
0.60  0.77    m  False
0.50  0.28    k  False

In [81]:
ramka2.columns = ["a", "b", "c"]
ramka2

         a    b      c
0.25  0.81    k  False
0.70  0.33  NaN   True
0.30  0.19    k   True
0.60  0.77    m  False
0.50  0.28    k  False

In [82]:
ramka2.columns = [1, 2, 3]
ramka2

         1    2      3
0.25  0.81    k  False
0.70  0.33  NaN   True
0.30  0.19    k   True
0.60  0.77    m  False
0.50  0.28    k  False

In [84]:
# nie zadziaÅ‚a, bo nazwy kolumn to liczby caÅ‚kowite
ramka2["2"]

KeyError: '2'

In [83]:
ramka2[2]

0.25      k
0.70    NaN
0.30      k
0.60      m
0.50      k
Name: 2, dtype: category
Categories (2, object): [k, m]

In [85]:
ramka2.index.name = "wiersze"
ramka2.columns.name = "kolumny"
ramka2

kolumny     1    2      3
wiersze
0.25     0.81    k  False
0.70     0.33  NaN   True
0.30     0.19    k   True
0.60     0.77    m  False
0.50     0.28    k  False

In [86]:
ramka2.reset_index()

kolumny  wiersze     1    2      3
0           0.25  0.81    k  False
1           0.70  0.33  NaN   True
2           0.30  0.19    k   True
3           0.60  0.77    m  False
4           0.50  0.28    k  False

In [87]:
ramka2.reset_index(drop=True)

kolumny     1    2      3
0        0.81    k  False
1        0.33  NaN   True
2        0.19    k   True
3        0.77    m  False
4        0.28    k  False

# MultiIndeksy (MultiIndex, indeks hierarchiczny)

In [88]:
ramka2 = pd.DataFrame({"A" : np.round(np.random.uniform(0, 1, 6), 2)})
ramka2

      A
0  0.05
1  0.83
2  0.12
3  0.68
4  0.76
5  0.29

In [89]:
ramka2.index = pd.MultiIndex(levels=[["x", "y", "z"], [1,2,3,4]], # jakie sÄ… dostÄ™pne poziomy
                            codes = [[0,0,0,1,1,2], [0,1,3,0,1,2]],
                            names=["i1", "i2"])
ramka2

          A
i1 i2
x  1   0.05
   2   0.83
   4   0.12
y  1   0.68
   2   0.76
z  3   0.29

# WybÃ³r wierszy

In [91]:
i = np.r_[0:10]
i

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [90]:
b = pd.Series(np.round(np.random.uniform(0,1,10), 2))
i = np.r_[0:10]
np.random.shuffle(i)
b.index = i
b

3    0.28
5    0.76
2    0.87
6    0.03
8    0.42
9    0.38
0    0.54
4    0.03
7    0.70
1    0.05
dtype: float64

In [92]:
c = b.copy()
c.index = ["a", "b", "c", "d", "e", "f", "g", "h", "i", "j"]
c

a    0.28
b    0.76
c    0.87
d    0.03
e    0.42
f    0.38
g    0.54
h    0.03
i    0.70
j    0.05
dtype: float64

# Wybieramy slicem

In [93]:
b[0:2] # wybraÅ‚o siÄ™ po pozycji (ktÃ³ry z kolei)

3    0.28
5    0.76
dtype: float64

In [94]:
c[0:2]

a    0.28
b    0.76
dtype: float64

## Wybieramy warunkiem logicznym

In [96]:
b[b > 0.4] # oczywiste, nie zaleÅ¼y od indeksu

5    0.76
2    0.87
8    0.42
0    0.54
7    0.70
dtype: float64

In [97]:
c[c > 0.4]

b    0.76
c    0.87
e    0.42
g    0.54
i    0.70
dtype: float64

## Podajemy pojedynczÄ… liczbÄ™ caÅ‚kowitÄ…

In [98]:
b[0] # nie po pozycji, ale po indeksie

0.54

In [99]:
c[0]

0.28

## Podajemy listÄ™

In [100]:
b[[0,1]] # po indeksie

0    0.54
1    0.05
dtype: float64

In [101]:
c[[0,1]]

a    0.28
b    0.76
dtype: float64

Zasada jest taka: jeÅ¼eli podajemy bezpoÅ›rednio (b[0], c["a"]) lub na liÅ›cie (b[[0,1]], c[["a", "b"]]), to najpierw prÃ³buje sprawdziÄ‡, czy typ zgadza siÄ™ z typem indeksu. JeÅ›li tak, szuka po indeksie (Pandasowym). JeÅ›li typy siÄ™ nie zgadzajÄ…, a podaliÅ›my liczbÄ™ caÅ‚kowitÄ…, to szuka po pozycji.

In [102]:
c["e"] # po indeksie

0.42

In [103]:
b["e"]

KeyError: 'e'

Jak siÄ™ zabezpieczaÄ‡, Å¼eby mieÄ‡ zawsze pewnoÅ›Ä‡, czy bÄ™dzie po indeksie, czy po pozycji?

In [104]:
b.iloc[0] # iloc zawsze po pozycji

0.28

In [105]:
c.iloc[0]

0.28

In [106]:
b.loc[0] # loc zawsze po indeksie

0.54

In [107]:
c.loc[0]

TypeError: cannot do label indexing on <class 'pandas.core.indexes.base.Index'> with these indexers [0] of <class 'int'>

In [109]:
b.loc[6:4] # znajduje obserwacje z indeksem 6, znajduje obserwacje z indeksem 4, zwraca wszystko pomiÄ™dzy

6    0.03
8    0.42
9    0.38
0    0.54
4    0.03
dtype: float64

In [110]:
c.loc["b":"e"]

b    0.76
c    0.87
d    0.03
e    0.42
dtype: float64

## Dygresja: nieuknikatowy indeks

In [120]:
ramka3 = ramka1.copy()
ramka3.index = ["a", "a", "b", "b", "b"]
ramka3

      A    B      C
a  0.81    k  False
a  0.33  NaN   True
b  0.19    k   True
b  0.77    m  False
b  0.28    k  False

In [125]:
ramka3.loc["b"]

      A  B      C
b  0.19  k   True
b  0.77  m  False
b  0.28  k  False

In [124]:
ramka3.loc["b"].iloc[0]

A    0.19
B       k
C    True
Name: b, dtype: object

# Wstawianie kolumn/wierszy

In [111]:
ramka1

      A    B      C
0  0.81    k  False
1  0.33  NaN   True
2  0.19    k   True
3  0.77    m  False
4  0.28    k  False

In [112]:
ramka1.A+10

0    10.81
1    10.33
2    10.19
3    10.77
4    10.28
Name: A, dtype: float64

In [113]:
np.exp(ramka1.A)

0    2.247908
1    1.390968
2    1.209250
3    2.159766
4    1.323130
Name: A, dtype: float64

In [114]:
ramka1["D"] = np.exp(ramka1.A)+1000

In [115]:
ramka1

      A    B      C            D
0  0.81    k  False  1002.247908
1  0.33  NaN   True  1001.390968
2  0.19    k   True  1001.209250
3  0.77    m  False  1002.159766
4  0.28    k  False  1001.323130

In [116]:
ramka1.drop("D", axis=1, inplace=True)

In [117]:
ramka1

      A    B      C
0  0.81    k  False
1  0.33  NaN   True
2  0.19    k   True
3  0.77    m  False
4  0.28    k  False

In [118]:
ramka1.loc[8] = [11, "m", True]
ramka1

       A    B      C
0   0.81    k  False
1   0.33  NaN   True
2   0.19    k   True
3   0.77    m  False
4   0.28    k  False
8  11.00    m   True

In [119]:
ramka1.drop(8, inplace=True)
ramka1

      A    B      C
0  0.81    k  False
1  0.33  NaN   True
2  0.19    k   True
3  0.77    m  False
4  0.28    k  False

# Funkcje statystyczne, przetwarzanie ramek

In [126]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [127]:
tips.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [128]:
tips.describe(include="all")

        total_bill         tip   sex smoker  day    time        size
count   244.000000  244.000000   244    244  244     244  244.000000
unique         NaN         NaN     2      2    4       2         NaN
top            NaN         NaN  Male     No  Sat  Dinner         NaN
freq           NaN         NaN   157    151   87     176         NaN
mean     19.785943    2.998279   NaN    NaN  NaN     NaN    2.569672
std       8.902412    1.383638   NaN    NaN  NaN     NaN    0.951100
min       3.070000    1.000000   NaN    NaN  NaN     NaN    1.000000
25%      13.347500    2.000000   NaN    NaN  NaN     NaN    2.000000
50%      17.795000    2.900000   NaN    NaN  NaN     NaN    2.000000
75%      24.127500    3.562500   NaN    NaN  NaN     NaN    3.000000
max      50.810000   10.000000   NaN    NaN  NaN     NaN    6.000000

In [129]:
tips.mean()

total_bill    19.785943
tip            2.998279
size           2.569672
dtype: float64

In [130]:
tips.std()

total_bill    8.902412
tip           1.383638
size          0.951100
dtype: float64

In [131]:
tips.sex.describe()

count      244
unique       2
top       Male
freq       157
Name: sex, dtype: object

In [132]:
tips.tip.describe()

count    244.000000
mean       2.998279
std        1.383638
min        1.000000
25%        2.000000
50%        2.900000
75%        3.562500
max       10.000000
Name: tip, dtype: float64

# Tabela przestawna (pivot table)

In [133]:
pd.pivot_table(tips[["smoker", "total_bill", "tip"]],
              index="smoker") # domyÅ›lnie liczy mean

             tip  total_bill
smoker
Yes     3.008710   20.756344
No      2.991854   19.188278

In [134]:
pd.pivot_table(tips[["smoker", "total_bill", "tip"]],
              index="smoker", aggfunc="sum")

           tip  total_bill
smoker
Yes     279.81     1930.34
No      451.77     2897.43

In [135]:
pd.pivot_table(tips[["smoker", "total_bill", "tip"]],
              columns="smoker", aggfunc="sum")

smoker          Yes       No
tip          279.81   451.77
total_bill  1930.34  2897.43

In [138]:
pd.pivot_table(tips[["smoker", "total_bill", "tip"]],
              columns="smoker", aggfunc="count") # count zlicza wartoÅ›ci non-null, czy nie nan i nie None

smoker      Yes   No
tip          93  151
total_bill   93  151

In [139]:
pd.pivot_table(tips[["smoker", "total_bill", "tip"]],
              columns="smoker", aggfunc="size") # size zlicza rekordy/wiersze/obserwacje jako takie

smoker
Yes     93
No     151
dtype: int64

In [140]:
pd.pivot_table(tips[["smoker", "total_bill", "tip"]],
              columns="smoker", aggfunc="min")

smoker       Yes    No
tip         1.00  1.00
total_bill  3.07  7.25

In [141]:
pd.pivot_table(tips[["smoker", "total_bill", "tip"]],
              columns="smoker", aggfunc="max")

smoker        Yes     No
tip         10.00   9.00
total_bill  50.81  48.33

In [142]:
pd.pivot_table(tips[["smoker", "total_bill", "tip"]],
              columns="smoker", aggfunc="median")

smoker        Yes     No
tip          3.00   2.74
total_bill  17.92  17.59

In [143]:
pd.pivot_table(tips[["smoker", "total_bill", "tip"]],
              columns="smoker", aggfunc="std")

smoker           Yes        No
tip         1.401468  1.377190
total_bill  9.832154  8.255582

In [146]:
pd.pivot_table(tips[["smoker", "sex", "day", "time", "total_bill", "tip"]],
              columns=["day","sex"]
              )

            day   sex
total_bill  Thur  Male      18.714667
                  Female    16.715312
            Fri   Male      19.857000
                  Female    14.145556
            Sat   Male      20.802542
                  Female    19.680357
            Sun   Male      21.887241
                  Female    19.872222
tip         Thur  Male       2.980333
                  Female     2.575625
            Fri   Male       2.693000
                  Female     2.781111
            Sat   Male       3.083898
                  Female     2.801786
            Sun   Male       3.220345
                  Female     3.367222
dtype: float64

In [147]:
pd.pivot_table(tips[["smoker", "sex", "day", "time", "total_bill", "tip"]],
              index=["day","sex"]
              )

                  tip  total_bill
day  sex
Thur Male    2.980333   18.714667
     Female  2.575625   16.715312
Fri  Male    2.693000   19.857000
     Female  2.781111   14.145556
Sat  Male    3.083898   20.802542
     Female  2.801786   19.680357
Sun  Male    3.220345   21.887241
     Female  3.367222   19.872222

In [145]:
pd.pivot_table(tips[["smoker", "sex", "day", "time", "total_bill", "tip"]],
              columns=["day"],
               index=["sex"]
              )

             tip                               total_bill             \
day         Thur       Fri       Sat       Sun       Thur        Fri
sex
Male    2.980333  2.693000  3.083898  3.220345  18.714667  19.857000
Female  2.575625  2.781111  2.801786  3.367222  16.715312  14.145556


day           Sat        Sun
sex
Male    20.802542  21.887241
Female  19.680357  19.872222

In [148]:
pd.pivot_table(tips[["smoker", "sex", "day", "time", "total_bill", "tip"]],
              columns=["smoker", "day"],
               index=["time", "sex"]
              )

                 tip                                                       \
smoker           Yes                                   No
day             Thur    Fri       Sat       Sun      Thur   Fri       Sat
time   sex
Lunch  Male    3.058  1.900       NaN       NaN  2.941500   NaN       NaN
       Female  2.990  2.660       NaN       NaN  2.437083  3.00       NaN
Dinner Male      NaN  3.246  2.879259  3.521333       NaN  2.50  3.256563
       Female    NaN  2.700  2.868667  3.500000  3.000000  3.25  2.724615

                        total_bill                                   \
smoker                         Yes
day                 Sun       Thur        Fri        Sat        Sun
time   sex
Lunch  Male         NaN  19.171000  11.386667        NaN        NaN
       Female       NaN  19.218571  13.260000        NaN        NaN
Dinner Male    3.115349        NaN  25.892000  21.837778  26.141333
       Female  3.329286        NaN  12.200000  20.266667  16.540000


smoker                No
day                 Thur     Fri        Sat        Sun
time   sex
Lunch  Male    18.486500     NaN        NaN        NaN
       Female  15.899167  15.980        NaN        NaN
Dinner Male          NaN  17.475  19.929063  20.403256
       Female  18.780000  22.750  19.003846  20.824286

In [150]:
pd.pivot_table(tips[["smoker", "sex", "day", "time", "total_bill", "tip"]],
              columns=["smoker", "day"],
               index=["time", "sex"],
               margins=True, 
               margins_name='Moj margines'
              )

                       tip                                               \
smoker                 Yes                                   No
day                   Thur    Fri       Sat       Sun      Thur     Fri
time         sex
Lunch        Male    3.058  1.900       NaN       NaN  2.941500     NaN
             Female  2.990  2.660       NaN       NaN  2.437083  3.0000
Dinner       Male      NaN  3.246  2.879259  3.521333       NaN  2.5000
             Female    NaN  2.700  2.868667  3.500000  3.000000  3.2500
Moj margines         3.030  2.714  2.875476  3.516842  2.673778  2.8125

                                                     total_bill             \
smoker                                  Moj margines        Yes
day                       Sat       Sun                    Thur        Fri
time         sex
Lunch        Male         NaN       NaN     2.882121  19.171000  11.386667
             Female       NaN       NaN     2.582857  19.218571  13.260000
Dinner       Male    3.256563  3.115349     3.144839        NaN  25.892000
             Female  2.724615  3.329286     3.002115        NaN  12.200000
Moj margines         3.102889  3.167895     2.998279  19.190588  16.813333

                                                                         \
smoker                                            No
day                        Sat        Sun       Thur     Fri        Sat
time         sex
Lunch        Male          NaN        NaN  18.486500     NaN        NaN
             Female        NaN        NaN  15.899167  15.980        NaN
Dinner       Male    21.837778  26.141333        NaN  17.475  19.929063
             Female  20.266667  16.540000  18.780000  22.750  19.003846
Moj margines         21.276667  24.120000  17.113111  18.420  19.661778


smoker                         Moj margines
day                        Sun
time         sex
Lunch        Male          NaN    18.048485
             Female        NaN    16.339143
Dinner       Male    20.403256    21.461452
             Female  20.824286    19.213077
Moj margines         20.506667    19.785943

# Groupby

In [152]:
flights.head()

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [153]:
flights.groupby("year")

In [154]:
flights.groupby("year").mean()

      passengers
year
1949  126.666667
1950  139.666667
1951  170.166667
1952  197.000000
1953  225.000000
1954  238.916667
1955  284.000000
1956  328.250000
1957  368.416667
1958  381.000000
1959  428.333333
1960  476.166667

In [155]:
tips.groupby(["sex", "smoker"]).mean()

               total_bill       tip      size
sex    smoker
Male   Yes      22.284500  3.051167  2.500000
       No       19.791237  3.113402  2.711340
Female Yes      17.977879  2.931515  2.242424
       No       18.105185  2.773519  2.592593

In [156]:
tips.groupby(["sex", "smoker"]).mean().reset_index()

      sex smoker  total_bill       tip      size
0    Male    Yes   22.284500  3.051167  2.500000
1    Male     No   19.791237  3.113402  2.711340
2  Female    Yes   17.977879  2.931515  2.242424
3  Female     No   18.105185  2.773519  2.592593

In [159]:
tips.groupby(["sex", "smoker"])["total_bill"].mean()

sex     smoker
Male    Yes       22.284500
        No        19.791237
Female  Yes       17.977879
        No        18.105185
Name: total_bill, dtype: float64

In [158]:
tips.groupby(["sex", "smoker"])["total_bill"].mean().reset_index()

      sex smoker  total_bill
0    Male    Yes   22.284500
1    Male     No   19.791237
2  Female    Yes   17.977879
3  Female     No   18.105185

In [163]:
# jest Å‚adnie, tylko wiÄ™cej pisania
pd.DataFrame(tips.groupby(["sex", "smoker"])["total_bill"].mean())

               total_bill
sex    smoker
Male   Yes      22.284500
       No       19.791237
Female Yes      17.977879
       No       18.105185

In [161]:
tips.groupby(["sex", "smoker"]).count()

               total_bill  tip  day  time  size
sex    smoker
Male   Yes             60   60   60    60    60
       No              97   97   97    97    97
Female Yes             33   33   33    33    33
       No              54   54   54    54    54

In [162]:
tips.groupby(["sex", "smoker"])["total_bill"].size()

sex     smoker
Male    Yes       60
        No        97
Female  Yes       33
        No        54
Name: total_bill, dtype: int64

# Tabela kontyngencji

Po prostu zliczanie ile obserwacji wpada do danej kategorii

In [164]:
# jednowymiarowo
tips.smoker.value_counts()

No     151
Yes     93
Name: smoker, dtype: int64

In [165]:
# dwuwymiarowa
pd.crosstab(tips.smoker, tips.sex)

sex     Male  Female
smoker
Yes       60      33
No        97      54

In [166]:
pd.crosstab([tips.smoker, tips.time], [tips.sex, tips.day])

sex           Male             Female
day           Thur Fri Sat Sun   Thur Fri Sat Sun
smoker time
Yes    Lunch    10   3   0   0      7   3   0   0
       Dinner    0   5  27  15      0   4  15   4
No     Lunch    20   0   0   0     24   1   0   0
       Dinner    0   2  32  43      1   1  13  14

In [168]:
pd.crosstab([tips.smoker, tips.time], [tips.sex, tips.day],
            margins=True, margins_name="moj margines")

sex                 Male             Female             moj margines
day                 Thur Fri Sat Sun   Thur Fri Sat Sun
smoker       time
Yes          Lunch    10   3   0   0      7   3   0   0           23
             Dinner    0   5  27  15      0   4  15   4           70
No           Lunch    20   0   0   0     24   1   0   0           45
             Dinner    0   2  32  43      1   1  13  14          106
moj margines          30  10  59  58     32   9  28  18          244

# Sortowanie

In [169]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [170]:
tips.sort_values("total_bill")

     total_bill    tip     sex smoker   day    time  size
67         3.07   1.00  Female    Yes   Sat  Dinner     1
92         5.75   1.00  Female    Yes   Fri  Dinner     2
111        7.25   1.00  Female     No   Sat  Dinner     1
172        7.25   5.15    Male    Yes   Sun  Dinner     2
149        7.51   2.00    Male     No  Thur   Lunch     2
..          ...    ...     ...    ...   ...     ...   ...
182       45.35   3.50    Male    Yes   Sun  Dinner     3
156       48.17   5.00    Male     No   Sun  Dinner     6
59        48.27   6.73    Male     No   Sat  Dinner     4
212       48.33   9.00    Male     No   Sat  Dinner     4
170       50.81  10.00    Male    Yes   Sat  Dinner     3

[244 rows x 7 columns]

In [172]:
tips.sort_values("total_bill", ascending=False)

     total_bill    tip     sex smoker   day    time  size
170       50.81  10.00    Male    Yes   Sat  Dinner     3
212       48.33   9.00    Male     No   Sat  Dinner     4
59        48.27   6.73    Male     No   Sat  Dinner     4
156       48.17   5.00    Male     No   Sun  Dinner     6
182       45.35   3.50    Male    Yes   Sun  Dinner     3
..          ...    ...     ...    ...   ...     ...   ...
149        7.51   2.00    Male     No  Thur   Lunch     2
111        7.25   1.00  Female     No   Sat  Dinner     1
172        7.25   5.15    Male    Yes   Sun  Dinner     2
92         5.75   1.00  Female    Yes   Fri  Dinner     2
67         3.07   1.00  Female    Yes   Sat  Dinner     1

[244 rows x 7 columns]

In [174]:
tips.total_bill.sort_values() # w typie Series nie podajemy po czym sortujemy, bo to oczywiste

67      3.07
92      5.75
111     7.25
172     7.25
149     7.51
       ...
182    45.35
156    48.17
59     48.27
212    48.33
170    50.81
Name: total_bill, Length: 244, dtype: float64

In [175]:
tips.total_bill.sort_values(ascending=False)

170    50.81
212    48.33
59     48.27
156    48.17
182    45.35
       ...
149     7.51
172     7.25
111     7.25
92      5.75
67      3.07
Name: total_bill, Length: 244, dtype: float64

In [177]:
tips.sort_values(["size", "total_bill"])

     total_bill   tip     sex smoker   day    time  size
67         3.07  1.00  Female    Yes   Sat  Dinner     1
111        7.25  1.00  Female     No   Sat  Dinner     1
222        8.58  1.92    Male    Yes   Fri   Lunch     1
82        10.07  1.83  Female     No  Thur   Lunch     1
92         5.75  1.00  Female    Yes   Fri  Dinner     2
..          ...   ...     ...    ...   ...     ...   ...
142       41.19  5.00    Male     No  Thur   Lunch     5
143       27.05  5.00  Female     No  Thur   Lunch     6
125       29.80  4.20  Female     No  Thur   Lunch     6
141       34.30  6.70    Male     No  Thur   Lunch     6
156       48.17  5.00    Male     No   Sun  Dinner     6

[244 rows x 7 columns]

In [178]:
tips.sort_values(["size", "total_bill"], ascending=[True, False])

     total_bill   tip     sex smoker   day    time  size
82        10.07  1.83  Female     No  Thur   Lunch     1
222        8.58  1.92    Male    Yes   Fri   Lunch     1
111        7.25  1.00  Female     No   Sat  Dinner     1
67         3.07  1.00  Female    Yes   Sat  Dinner     1
184       40.55  3.00    Male    Yes   Sun  Dinner     2
..          ...   ...     ...    ...   ...     ...   ...
185       20.69  5.00    Male     No   Sun  Dinner     5
156       48.17  5.00    Male     No   Sun  Dinner     6
141       34.30  6.70    Male     No  Thur   Lunch     6
125       29.80  4.20  Female     No  Thur   Lunch     6
143       27.05  5.00  Female     No  Thur   Lunch     6

[244 rows x 7 columns]

# Bonus: zmienne czasowe

In [179]:
pd.date_range("2020-01-01", periods=3)

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03'], dtype='datetime64[ns]', freq='D')

In [180]:
pd.Series(pd.date_range("2020-01-01", periods=3))

0   2020-01-01
1   2020-01-02
2   2020-01-03
dtype: datetime64[ns]

In [182]:
pd.date_range("2020-01-01 08:30:00", periods=3, freq="12H")

DatetimeIndex(['2020-01-01 08:30:00', '2020-01-01 20:30:00',
               '2020-01-02 08:30:00'],
              dtype='datetime64[ns]', freq='12H')